rickymetz/esp32-hackathon/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash, QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-S3R8 has 8MB OCTAL PSRAM. OCT mode is NOT the IDF default --
# without it the PSRAM silently fails to initialise.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Room for LVGL + Lua
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
